app/controllers/affiliates_controller.rb

  def index
    @affiliates = Affiliate.all
---
SELECT * FROM `affiliates`

  def show
    @affiliate = Affiliate.find(params[:id])
---
SELECT * FROM `affiliates` WHERE (`affiliates`.`id` = 1)

  def create
    @affiliate = Affiliate.new(params[:affiliate])

    respond_to do |format|
      if @affiliate.save
---
INSERT INTO `affiliates` (`created_at`, `updated_at`, `url`, `org_name`) VALUES('2009-12-31 18:48:01', '2009-12-31 18:48:01', 'ecaucp.org', '')